package whileTasks;

public class whileTask1 {
    public static void main (String [] args) {
        // Написать консольную программу, которая при помощи цикла while печатает на консоли числа от 0 до 100.

        int i = 0;

        while (i <= 100) {
            System.out.println(i);
            i++;
        }

    }
}
